Documents/АктКлиенту.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>АктКлиенту</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ВзаиморасчётыСКлиентами</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Клиент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Клиенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыАкта</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Начисления</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Кампания</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.РекламныеКампании</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Лиды</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Депозиты</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаДепозитов</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

AccumulationRegisters/ВзаиморасчётыСКлиентами.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>ВзаиморасчётыСКлиентами</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Клиент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Клиенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаУпр</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

AccumulationRegisters/Конверсии.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>Конверсии</Name>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Кампания</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РекламныеКампании</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Resource>
				<Properties>
					<Name>Лиды</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Депозиты</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаДепозитов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Enums/СтатусыАкта.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>СтатусыАкта</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Черновик</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Выставлен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Оплачен</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/МоделиРасчёта.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>МоделиРасчёта</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>CPA</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>RevShare</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Гибрид</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/АктКлиенту/Ext/ObjectModule.bsl
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Статус = Перечисления.СтатусыАкта.Черновик;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если РежимЗаписи = РежимЗаписиДокумента.Проведение
		И Статус = Перечисления.СтатусыАкта.Черновик Тогда
		Статус = Перечисления.СтатусыАкта.Выставлен;
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	СуммаДокумента = Начисления.Итог("Сумма");
	Курс = РаботаСВалютами.ПолучитьКурс(Валюта, Дата);
	
	Движения.ВзаиморасчётыСКлиентами.Записывать = Истина;
	Движение = Движения.ВзаиморасчётыСКлиентами.ДобавитьПриход();
	Движение.Период = Дата;
	Движение.Клиент = Клиент;
	Движение.Валюта = Валюта;
	Движение.Сумма = СуммаДокумента;
	Движение.СуммаУпр = СуммаДокумента * Курс;
	
КонецПроцедуры

Процедура ЗаполнитьПоКонверсиям() Экспорт
	
	Начисления.Очистить();
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	КонверсииОбороты.Кампания КАК Кампания,
	|	КонверсииОбороты.Кампания.Оффер.МодельРасчёта КАК МодельРасчёта,
	|	КонверсииОбороты.Кампания.Оффер.СтавкаCPA КАК СтавкаCPA,
	|	КонверсииОбороты.Кампания.Оффер.ПроцентRevShare КАК ПроцентRevShare,
	|	КонверсииОбороты.Кампания.Оффер.Валюта КАК ВалютаОффера,
	|	КонверсииОбороты.ЛидыОборот КАК Лиды,
	|	КонверсииОбороты.ДепозитыОборот КАК Депозиты,
	|	КонверсииОбороты.СуммаДепозитовОборот КАК СуммаДепозитов
	|ИЗ
	|	РегистрНакопления.Конверсии.Обороты(&ДатаНачала, &ДатаОкончания, , Кампания.Оффер.Владелец = &Клиент) КАК КонверсииОбороты";
	Запрос.УстановитьПараметр("ДатаНачала", ДатаНачала);
	Запрос.УстановитьПараметр("ДатаОкончания", ДатаОкончания);
	Запрос.УстановитьПараметр("Клиент", Клиент);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		НоваяСтрока = Начисления.Добавить();
		НоваяСтрока.Кампания = Выборка.Кампания;
		НоваяСтрока.Лиды = Выборка.Лиды;
		НоваяСтрока.Депозиты = Выборка.Депозиты;
		НоваяСтрока.СуммаДепозитов = Выборка.СуммаДепозитов;
		СуммаCPA = 0;
		СуммаRevShare = 0;
		Если Выборка.МодельРасчёта = Перечисления.МоделиРасчёта.CPA
			Или Выборка.МодельРасчёта = Перечисления.МоделиРасчёта.Гибрид Тогда
			СуммаCPA = Выборка.Лиды * Выборка.СтавкаCPA;
		КонецЕсли;
		Если Выборка.МодельРасчёта = Перечисления.МоделиРасчёта.RevShare
			Или Выборка.МодельРасчёта = Перечисления.МоделиРасчёта.Гибрид Тогда
			СуммаRevShare = Выборка.СуммаДепозитов * Выборка.ПроцентRevShare / 100;
		КонецЕсли;
		НоваяСтрока.Сумма = СуммаCPA + СуммаRevShare;
		Если Валюта.Пустая() Тогда
			Валюта = Выборка.ВалютаОффера;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры
